---
kind: property
id: P:Autodesk.Revit.DB.EdgeArray.Size
source: html/1f9ca1a4-9f52-6252-bce5-87226473e961.htm
---
# Autodesk.Revit.DB.EdgeArray.Size Property

Returns the number of edges that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```